Revit 2027 API
TableSectionData.SetCellCalculatedValue(Int32, TableCellCalculatedValueData) Method
 Allows the caller to set the calculated value for a specified column
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCellCalculatedValue(
	int nCol,
	TableCellCalculatedValueData pCalcValue
)
Public Sub SetCellCalculatedValue (
	nCol As Integer,
	pCalcValue As TableCellCalculatedValueData
)
public:
void SetCellCalculatedValue(
	int nCol,
	TableCellCalculatedValueData^ pCalcValue
)
member SetCellCalculatedValue :
        nCol : int *
        pCalcValue : TableCellCalculatedValueData -> unit
Parameters
nCol Int32
pCalcValue TableCellCalculatedValueData
Exceptions
Exception | Condition
ArgumentException |  The given column number nCol is invalid.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This operation is forbidden for cells in standard schedule header sections. -or- This operation is forbidden for cells in standard schedule body sections.
See Also
Reference
TableSectionData Class
SetCellCalculatedValue Overload
Autodesk.Revit.DB Namespace